#+OPTIONS: toc:nil

** Weave

To weave the current file (in other words, to generate documentation), run
the following command:

#+begin_src elisp
(org-gfm-export-to-markdown)
#+end_src

#+RESULTS:
: README.md

** lit-file Snippet                                               :noexport:

Add a snippet file, to make adding literate programming files easier. 

file:~/.emacs.d/snippets/org-mode/lit-file
#+begin_src snippet :tangle ~/.emacs.d/snippets/org-mode/lit-file :noweb no-export
# -*- mode: snippet -*-
# name: add literate file
# key: lit-file
# --
file:$1
,#+begin_src $2 :tangle $1 :noweb no-export
$0
,#+end_src
#+end_src

After tangling the above file, run the following to make it available:

#+begin_src elisp
(yas-reload-all)
#+end_src

#+RESULTS:
: [yas] Prepared just-in-time loading of snippets successfully.


** lit-sec Snippet                                                :noexport:

Add a snippet file, to make adding literate programming sections easier. 

file:~/.emacs.d/snippets/org-mode/lit-sec
#+begin_src snippet :tangle ~/.emacs.d/snippets/org-mode/lit-sec :noweb no-export
# -*- mode: snippet -*-
# name: add literate section
# key: lit-sec
# --
$1+=
,#+begin_src $2 :noweb no-export :noweb-ref $1
$0
,#+end_src
#+end_src

After tangling the above file, run the following to make it available:

#+begin_src elisp
(yas-reload-all)
#+end_src

#+RESULTS:
: [yas] Prepared just-in-time loading of snippets successfully.


